In [1]:
import pandas as pd

Задание 1

Скачайте с сайта датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [4]:
rating=pd.read_csv('ratings.csv')
rating.head(5)

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [3]:
rating[rating['rating']==5.0]['movieId'].value_counts().head(1)

318    39553
Name: movieId, dtype: int64

Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики 
(Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. 
Не учитывайте в расчетах отрицательные значения quantity.

In [5]:
power=pd.read_csv('power.csv')
power.head(5)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [6]:
fp_1=power[power.category.isin([4,12,21])]
fp_1.head()

        country  year  quantity  category
9834  Swaziland  2014      0.15         4
9835  Swaziland  2013      0.15         4
9836  Swaziland  2012      0.15         4
9837  Swaziland  2011      0.15         4
9838  Swaziland  2010      0.18         4

In [7]:
fp_2=fp_1[(fp_1['year']>=2005)&(fp_1['year']<=2010)&(fp_1['quantity']>0)]
fp_2.head()

        country  year  quantity  category
9838  Swaziland  2010    0.1800         4
9839  Swaziland  2009    0.2100         4
9840  Swaziland  2008    0.3100         4
9841  Swaziland  2007    0.3080         4
9842  Swaziland  2006    0.2957         4

In [8]:
summ = fp_2[fp_2.country.str.contains('|'.join(['Lat','Lit','Est']))]['quantity'].sum()
print(summ)

240580.0

Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [9]:
page_url = 'https://www.finam.ru/quotes/currencies/'
df = pd.read_html(page_url, encoding='utf-8')

In [10]:
df[:5]

[    Unnamed: 0                  Èíñòðóìåíò Ïîñë. ñäåëêà % Èçì. öåíû  Îòêðûòèå  \
 0          NaN                     Eur/Chf   1.0787 CHF      -0.27%    1.0816
 1          NaN                     Eur/Jpy  126.229 JPY      -0.33%  126.6130
 2          NaN                     Eur/Usd     1.2146 $      -0.51%    1.2205
 3          NaN                     Usd/Chf   0.8881 CHF       0.23%    0.8863
 4          NaN                     Gbp/Usd     1.3619 $      -0.31%    1.3664
 5          NaN                     Usd/Jpy   103.93 JPY       0.19%  103.7700
 6          NaN                     Usd/Cad   1.2717 CAD       0.06%    1.2709
 7          NaN                     Aud/Nzd    1.076 NZD       0.04%    1.0769
 8          NaN             Èíäåêñ äîëëàðà*       90.4 $       0.38%   89.9800
 9          NaN                     Aud/Usd     0.7729 $      -0.54%    0.7770
 10         NaN              AMDRUB êóðñ ÖÁ         0.14      -0.01%       NaN
 11         NaN                     Aud/Cad   0.9828 CAD      -0.47%    0.9874
 12         NaN                     Aud/Chf   0.6864 CHF      -0.32%    0.6885
 13         NaN                     Aud/Dkk   4.7337 DKK      -0.04%    4.7345
 14         NaN                     Aud/Jpy   80.326 JPY      -0.35%   80.6280
 15         NaN                     Aud/Nok   6.5697 NOK       0.09%    6.5672
 16         NaN                     Aud/Sek   6.4448 SEK       0.69%    6.4011
 17         NaN                     Aud/Sgd   1.0256 SGD      -0.26%    1.0280
 18         NaN              AUDRUB êóðñ ÖÁ        57.06      -0.01%       NaN
 19         NaN              AZNRUB êóðñ ÖÁ        43.28      -0.01%       NaN
 20         NaN                     BCH-USD     474.42 $         NaN       NaN
 21         NaN              BGNRUB êóðñ ÖÁ        45.85      -0.01%       NaN
 22         NaN              Bitcoin / Euro     28488.39         NaN       NaN
 23         NaN       Bitcoin / U.S. dollar     34652.55         NaN       NaN
 24         NaN      Bitcoin Cash / Bitcoin   0.01372027         NaN       NaN
 25         NaN         Bitcoin Cash / Euro        391.5         NaN       NaN
 26         NaN  Bitcoin Cash / U.S. dollar       475.02         NaN       NaN
 27         NaN                  BKTRUB_TOM      39.26 ₽       0.41%       NaN
 28         NaN              BRLRUB êóðñ ÖÁ        13.81       0.02%       NaN
 29         NaN                     BTC-EUR   28529.37          NaN       NaN

        Ìàêñ.      Ìèí.     Çàêðûòèå  Îáúåì, øò.      Âðåìÿ îáí.
 0     1.0824    1.0784      1.08160         NaN     13.01 20:23
 1   126.7630  126.2150    126.64900         NaN     13.01 20:23
 2     1.2223    1.2140      1.22080         NaN     13.01 20:23
 3     0.8889    0.8850      0.88610         NaN     13.01 20:23
 4     1.3701    1.3612      1.36620         NaN     13.01 20:23
 5   104.0000  103.5300    103.73000         NaN     13.01 20:23
 6     1.2747    1.2704      1.27090         NaN     13.01 20:23
 7     1.0784    1.0737      1.07560         NaN     13.01 20:23
 8    90.4400   89.8900     90.06000         NaN     13.01 20:23
 9     0.7782    0.7722      0.77710         NaN     13.01 20:23
 10       NaN       NaN      0.14000         NaN     14.01 00:00
 11    0.9888    0.9829      0.98740         NaN     13.01 20:23
 12    0.6894    0.6859      0.68860         NaN     13.01 20:23
 13    4.7399    4.7248      4.73570         NaN     13.01 20:23
 14   80.7200   80.2690     80.60600         NaN     13.01 20:23
 15    6.5747    6.5389      6.56400         NaN     13.01 20:23
 16    6.4580    6.3976      6.40040         NaN     13.01 20:23
 17    1.0290    1.0248      1.02830         NaN     13.01 20:23
 18       NaN       NaN     57.34000         NaN     14.01 00:00
 19       NaN       NaN     43.71000         NaN     14.01 00:00
 20       NaN       NaN    461.97000         NaN     13.01 20:23
 21       NaN       NaN     46.17000         NaN     14.01 00:00
 22       NaN       NaN  28109.35000         NaN     13.01 20:23
 23       NaN       NaN  34278.42000         NaN     13.01 20:23
 24       NaN       NaN      0.01355         NaN     13.01 20:23
 25       NaN       NaN    378.88000         NaN     13.01 20:23
 26       NaN       NaN    462.00000         NaN     13.01 20:23
 27       NaN       NaN     39.26000         NaN  25.06.14 18:36
 28       NaN       NaN     13.53000         NaN     14.01 00:00
 29       NaN       NaN  28128.44000         NaN     13.01 20:23  ]